changed readme and the backend connection
